app/controllers/microposts_controller.rb

INSERT INTO "microposts" ("content", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["content", "jkjk;lkj"], ["created_at", Tue, 29 Apr 2014 18:47:50 UTC +00:00], ["updated_at", Tue, 29 Apr 2014 18:47:50 UTC +00:00], ["user_id", 101]]
---
  def create
    @micropost = current_user.microposts.build(micropost_params)
    if @micropost.save